УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПосещениеАттракциона</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов();	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюЭлементов()
	
	ЭтоПосещениеАттракциона = (Объект.ВидНоменклатуры 
		= Перечисления.ВидыНоменклатуры.ПосещениеАттракциона);
	
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;

КонецПроцедуры

#КонецОбласти
